const sections = [
    {
        ID: 275,
        NAME: "Работа в компании",
        questions: [
            {
                ID: 495,
                IBLOCK_SECTION_ID: 275,
                NAME: "Где получить информацию новому сотруднику?",
                DETAIL_TEXT: "<p>Информация для новых сотрудников представлена в курсе Курс для новых сотрудников.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 496,
                IBLOCK_SECTION_ID: 275,
                NAME: "Как найти номер телефона нужного сотрудника?",
                DETAIL_TEXT: "<p>Выполните следующие действия. Перейдите на страницу Поиск сотрудника (Сотрудники > Поиск сотрудника). В форме поиска укажите фамилию и имя сотрудника. Нажмите кнопку Найти. В найденной визитке сотрудника посмотрите номер его телефона. Если телефон не указан, то вы можете написать персональное сообщение сотруднику и спросить его телефон.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 497,
                IBLOCK_SECTION_ID: 275,
                NAME: "Возможен ли карьерный рост?",
                DETAIL_TEXT: "<p>Карьерный рост, конечно же, возможен. На странице Вакансии (Компания > Карьера, вакансии) представлены имеющиеся в компании вакансии. Вы можете отправить резюме на интересующую вас должность.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 498,
                IBLOCK_SECTION_ID: 275,
                NAME: "Где получить информацию новому сотруднику?",
                DETAIL_TEXT: "<p>Информация для новых сотрудников представлена в курсе Курс для новых сотрудников.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 499,
                IBLOCK_SECTION_ID: 275,
                NAME: "Как найти номер телефона нужного сотрудника?",
                DETAIL_TEXT: "<p>Выполните следующие действия. Перейдите на страницу Поиск сотрудника (Сотрудники > Поиск сотрудника). В форме поиска укажите фамилию и имя сотрудника. Нажмите кнопку Найти. В найденной визитке сотрудника посмотрите номер его телефона. Если телефон не указан, то вы можете написать персональное сообщение сотруднику и спросить его телефон.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 500,
                IBLOCK_SECTION_ID: 275,
                NAME: "Возможен ли карьерный рост?",
                DETAIL_TEXT: "<p>Карьерный рост, конечно же, возможен. На странице Вакансии (Компания > Карьера, вакансии) представлены имеющиеся в компании вакансии. Вы можете отправить резюме на интересующую вас должность.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 501,
                IBLOCK_SECTION_ID: 275,
                NAME: "Где получить информацию новому сотруднику?",
                DETAIL_TEXT: "<p>Информация для новых сотрудников представлена в курсе Курс для новых сотрудников.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 502,
                IBLOCK_SECTION_ID: 275,
                NAME: "Как найти номер телефона нужного сотрудника?",
                DETAIL_TEXT: "<p>Выполните следующие действия. Перейдите на страницу Поиск сотрудника (Сотрудники > Поиск сотрудника). В форме поиска укажите фамилию и имя сотрудника. Нажмите кнопку Найти. В найденной визитке сотрудника посмотрите номер его телефона. Если телефон не указан, то вы можете написать персональное сообщение сотруднику и спросить его телефон.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 503,
                IBLOCK_SECTION_ID: 275,
                NAME: "Возможен ли карьерный рост?",
                DETAIL_TEXT: "<p>Карьерный рост, конечно же, возможен. На странице Вакансии (Компания > Карьера, вакансии) представлены имеющиеся в компании вакансии. Вы можете отправить резюме на интересующую вас должность.</p>",
                DETAIL_TYPE: "html"
            },
        ]
    },
    {
        ID: 276,
        NAME: "Работа с документами",
        questions: [
            {
                ID: 504,
                IBLOCK_SECTION_ID: 276,
                NAME: "Где получить информацию новому сотруднику?",
                DETAIL_TEXT: "<p>Информация для новых сотрудников представлена в курсе Курс для новых сотрудников.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 505,
                IBLOCK_SECTION_ID: 276,
                NAME: "Как найти номер телефона нужного сотрудника?",
                DETAIL_TEXT: "<p>Выполните следующие действия. Перейдите на страницу Поиск сотрудника (Сотрудники > Поиск сотрудника). В форме поиска укажите фамилию и имя сотрудника. Нажмите кнопку Найти. В найденной визитке сотрудника посмотрите номер его телефона. Если телефон не указан, то вы можете написать персональное сообщение сотруднику и спросить его телефон.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 506,
                IBLOCK_SECTION_ID: 276,
                NAME: "Возможен ли карьерный рост?",
                DETAIL_TEXT: "<p>Карьерный рост, конечно же, возможен. На странице Вакансии (Компания > Карьера, вакансии) представлены имеющиеся в компании вакансии. Вы можете отправить резюме на интересующую вас должность.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 507,
                IBLOCK_SECTION_ID: 276,
                NAME: "Где получить информацию новому сотруднику?",
                DETAIL_TEXT: "<p>Информация для новых сотрудников представлена в курсе Курс для новых сотрудников.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 508,
                IBLOCK_SECTION_ID: 276,
                NAME: "Как найти номер телефона нужного сотрудника?",
                DETAIL_TEXT: "<p>Выполните следующие действия. Перейдите на страницу Поиск сотрудника (Сотрудники > Поиск сотрудника). В форме поиска укажите фамилию и имя сотрудника. Нажмите кнопку Найти. В найденной визитке сотрудника посмотрите номер его телефона. Если телефон не указан, то вы можете написать персональное сообщение сотруднику и спросить его телефон.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 509,
                IBLOCK_SECTION_ID: 276,
                NAME: "Возможен ли карьерный рост?",
                DETAIL_TEXT: "<p>Карьерный рост, конечно же, возможен. На странице Вакансии (Компания > Карьера, вакансии) представлены имеющиеся в компании вакансии. Вы можете отправить резюме на интересующую вас должность.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 510,
                IBLOCK_SECTION_ID: 276,
                NAME: "Где получить информацию новому сотруднику?",
                DETAIL_TEXT: "<p>Информация для новых сотрудников представлена в курсе Курс для новых сотрудников.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 511,
                IBLOCK_SECTION_ID: 276,
                NAME: "Как найти номер телефона нужного сотрудника?",
                DETAIL_TEXT: "<p>Выполните следующие действия. Перейдите на страницу Поиск сотрудника (Сотрудники > Поиск сотрудника). В форме поиска укажите фамилию и имя сотрудника. Нажмите кнопку Найти. В найденной визитке сотрудника посмотрите номер его телефона. Если телефон не указан, то вы можете написать персональное сообщение сотруднику и спросить его телефон.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 512,
                IBLOCK_SECTION_ID: 276,
                NAME: "Возможен ли карьерный рост?",
                DETAIL_TEXT: "<p>Карьерный рост, конечно же, возможен. На странице Вакансии (Компания > Карьера, вакансии) представлены имеющиеся в компании вакансии. Вы можете отправить резюме на интересующую вас должность.</p>",
                DETAIL_TYPE: "html"
            },
        ]
    },
    {
        ID: 277,
        NAME: "Использование сервисов портала",
        questions: [
            {
                ID: 513,
                IBLOCK_SECTION_ID: 277,
                NAME: "Где получить информацию новому сотруднику?",
                DETAIL_TEXT: "<p>Информация для новых сотрудников представлена в курсе Курс для новых сотрудников.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 514,
                IBLOCK_SECTION_ID: 277,
                NAME: "Как найти номер телефона нужного сотрудника?",
                DETAIL_TEXT: "<p>Выполните следующие действия. Перейдите на страницу Поиск сотрудника (Сотрудники > Поиск сотрудника). В форме поиска укажите фамилию и имя сотрудника. Нажмите кнопку Найти. В найденной визитке сотрудника посмотрите номер его телефона. Если телефон не указан, то вы можете написать персональное сообщение сотруднику и спросить его телефон.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 515,
                IBLOCK_SECTION_ID: 277,
                NAME: "Возможен ли карьерный рост?",
                DETAIL_TEXT: "<p>Карьерный рост, конечно же, возможен. На странице Вакансии (Компания > Карьера, вакансии) представлены имеющиеся в компании вакансии. Вы можете отправить резюме на интересующую вас должность.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 516,
                IBLOCK_SECTION_ID: 277,
                NAME: "Где получить информацию новому сотруднику?",
                DETAIL_TEXT: "<p>Информация для новых сотрудников представлена в курсе Курс для новых сотрудников.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 517,
                IBLOCK_SECTION_ID: 277,
                NAME: "Как найти номер телефона нужного сотрудника?",
                DETAIL_TEXT: "<p>Выполните следующие действия. Перейдите на страницу Поиск сотрудника (Сотрудники > Поиск сотрудника). В форме поиска укажите фамилию и имя сотрудника. Нажмите кнопку Найти. В найденной визитке сотрудника посмотрите номер его телефона. Если телефон не указан, то вы можете написать персональное сообщение сотруднику и спросить его телефон.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 518,
                IBLOCK_SECTION_ID: 277,
                NAME: "Возможен ли карьерный рост?",
                DETAIL_TEXT: "<p>Карьерный рост, конечно же, возможен. На странице Вакансии (Компания > Карьера, вакансии) представлены имеющиеся в компании вакансии. Вы можете отправить резюме на интересующую вас должность.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 519,
                IBLOCK_SECTION_ID: 277,
                NAME: "Где получить информацию новому сотруднику?",
                DETAIL_TEXT: "<p>Информация для новых сотрудников представлена в курсе Курс для новых сотрудников.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 520,
                IBLOCK_SECTION_ID: 277,
                NAME: "Как найти номер телефона нужного сотрудника?",
                DETAIL_TEXT: "<p>Выполните следующие действия. Перейдите на страницу Поиск сотрудника (Сотрудники > Поиск сотрудника). В форме поиска укажите фамилию и имя сотрудника. Нажмите кнопку Найти. В найденной визитке сотрудника посмотрите номер его телефона. Если телефон не указан, то вы можете написать персональное сообщение сотруднику и спросить его телефон.</p>",
                DETAIL_TYPE: "html"
            },
            {
                ID: 521,
                IBLOCK_SECTION_ID: 277,
                NAME: "Возможен ли карьерный рост?",
                DETAIL_TEXT: "<p>Карьерный рост, конечно же, возможен. На странице Вакансии (Компания > Карьера, вакансии) представлены имеющиеся в компании вакансии. Вы можете отправить резюме на интересующую вас должность.</p>",
                DETAIL_TYPE: "html"
            },
        ]
    }
];

const getSections = () => sections.map(section => {
    const { ID, NAME } = section;
    return { ID, NAME }
});

const getSectionQuestion = (sectionId, page) => {
    const section = sections.find(s => "" + s.ID === "" + sectionId);

    if (!section) return [];

    const data = {
        questions: section.questions.slice(page * 5, page * 5 + 5),
        page: page,
        pages: Math.ceil(section.questions.length / 5)
    };

    return data;
}

const sectionsService = {
    getSections,
    getSectionQuestion
};

module.exports = sectionsService;
